blog/2017/03/git-packfiles/index.org
#+TITLE: Git Packfiles
#+DESCRIPTION: Introduction to Git Packfiles
#+TAGS: Git
#+TAGS: Internals
#+TAGS: Learning
#+DATE: 2017-03-01
#+SLUG: git-packfiles
#+LINK: git-scm https://git-scm.com/
#+LINK: git-in-reverse https://kennyballou.com/blog/2016/01/git-in-reverse
#+LINK: udiff https://www.gnu.org/software/diffutils/manual/html_node/Unified-Format.html
#+LINK: git-show https://www.kernel.org/pub/software/scm/git/docs/git-show.html
#+LINK: git-diff https://www.kernel.org/pub/software/scm/git/docs/git-diff.html
#+LINK: loose-objects-so http://stackoverflow.com/questions/5709687/what-are-the-loose-objects-that-the-git-gui-refers-to#5710039
#+LINK: git-internal-packfiles https://git-scm.com/book/en/v2/Git-Internals-Packfiles
#+LINK: git-verify-pack https://git-scm.com/docs/git-verify-pack
#+LINK: pack-format-txt https://git.kernel.org/cgit/git/git.git/tree/Documentation/technical/pack-format.txt
#+LINK: unpacking-packfiles https://codewords.recurse.com/issues/three/unpacking-git-packfiles/
#+LINK: git-gc https://www.kernel.org/pub/software/scm/git/docs/git-gc.html

#+BEGIN_PREVIEW
Previously, in [[git-in-reverse][Git in Reverse]], we learned
about [[https://git-scm.com/][Git]] and how it internally stores information.
Namely, we went over the [[loose-objects-so]["loose" object]] format that Git
uses for storage.  However, in the last post, we did not discuss how Git uses
another storage format to more compactly store files, changes, and ultimately
objects.  In this post we will discuss packfiles and how Git uses these
primarily for using less bandwidth and, only secondarily, using less storage
space for storing repository contents.
#+END_PREVIEW

We're only going to discuss the high-level details of packfiles, there are
[[git-internal-packfiles][plenty]] of [[git-verify-pack][sources]] that
[[pack-format-txt][describe]] the [[unpacking-packfiles][details]] better.

** Packfiles
:PROPERTIES:
:ID:       e571fbca-34f8-48b5-b511-b139f5e8156a
:END:

Packfiles, like [[git-in-reverse][git objects before]], are an internal file
set for storing objects in a more compressed format.  That is, instead of
storing /each/ version of a file in its entirety, Git can store a single
version of the file in its entirety and maintain an internal set of objects
which contain patches to derive the other versions.  Furthermore, Git can store
entire repository's objects into a single packfile, thus eliminating large
numbers of small files and improving efficiency of object access.

The actual files themselves are in the ~.git/objects/pack~ folder of a
repository and there are both pack, ~.pack~, files and index, ~.idx~, files.

Here is the packfile that contains this repository (as of this writing):

#+BEGIN_EXAMPLE
    ± find .git/objects/pack -type f
    .git/objects/pack/pack-31966bc41ef450ccfecdfb5ef6cd98f7097eea38.pack
    .git/objects/pack/pack-31966bc41ef450ccfecdfb5ef6cd98f7097eea38.idx
#+END_EXAMPLE

Notice, there are not two "packs", but two files that describe the same "pack".
There is the ~.pack~ file itself.  This is the file that contains the actual
objects.  There is also the ~.idx~ file which provides an "index" of the
objects contained in the pack.

We'll take a small moment to describe each in a little more detail.

*** Packs
:PROPERTIES:
:ID:       2769f358-432f-4363-b095-5319759246b4
:END:

Packfiles are relatively straight forward, there's a 12 byte header, first four
spell "PACK", next four provide the version, "2" as of this writing, and the
final four provide the number of objects in this pack.  Following the header,
there's a number of objects stored in a very compact but variable length
format.  Finally, there's a 20 byte trailer that is the checksum of the
packfile's contents-- header and objects.

In the header, the number of objects is encoded in a 4-byte integer, thus,
there can only be \(2\^{32}\) or little over 4 billion objects in a packfile.
However, this does not give an upper bound of the /size/ of the pack files
themselves on disk.  The length of each object is encoded in a variable length
integer prefacing each object in the packfile.

The format of the objects in the packfile is not as they usually exist in the
loose format, but it will compress them /more/, usually resulting in less space
used on disk.  That is, the objects stored in the packfile may be a base,
/undeltified/ object, or it may be a /deltified/ object.

Undeltified objects are not necessarily as interesting, for one, because they
are already [covered][3].  The deltified objects, however, are pretty
interesting, and definitely different.

The deltified objects, as the name might imply, contain the delta, or,
preferably, the patch and the base object name to create the defined object.
That is, Git will store inside a regular Git object a patch used to derive the
defined object.  But it only does this in the context of packfiles.
Furthermore, the structure allows for the base object to itself be a deltified
object, thus, making it possible to only store one version of the full file,
but then derive all other versions from deltas or patches.

While it is entirely possible to use only the packfile itself to access the
contained objects, it's not very efficient for random access.  Therefore, the
index file is created to maintain a way to peer into the packfile efficiently.

