blog/2017/03/git-packfiles/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-06-30 Thu 01:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Git Packfiles</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="kb" />
<meta name="description" content="Introduction to Git Packfiles"
 />
<meta charset="utf-8">

<meta name="author" content="Kenny Ballou">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

<title>~kb</title>

<link rel="canonical" href="/" />
<link href="/index.xml" rel="alternate" type="application/rss+xml"
      title="~kb/blog" />

<link rel="stylesheet" href="/css/simple.css" />
<link rel="stylesheet" href="/css/simple.add.css" />
<link rel="stylesheet" href="/css/katex.css" />
<link rel="stylesheet" href="/css/fa-all.css" />
<link rel="shortcut icon" href="/favicon.ico" type="image/x-icon" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://kennyballou.com/blog"> UP </a>
 |
 <a accesskey="H" href="https://kennyballou.com/"> HOME </a>
</div><header id="" class="status">
<nav>
  <a href="/about.html">
    <i class="fade fas fa-user-circle"></i>
  </a>
  <a href="https://git.sr.ht/~kennyballou/"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fas fa-code-branch fa-1x"></i>
  </a>
  <a href="https://github.com/kennyballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-github fa-1x"></i>
  </a>
  <a href="https://bitbucket.org/kballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-bitbucket fa-1x"></i>
  </a>
  <a href="https://linkedin.com/in/kennyballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-linkedin-in fa-1x"></i>
  </a>
  <a href="https://www.buymeacoffee.com/kennyballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fas fa-mug-hot fa-1x"></i>
  </a>
  <a href="/resume.pdf"
     target="_blank">
    <i class="fade far fa-file-pdf"></i>
  </a>
  <a href="/B74CC4B41148C3DB364BC21182D94B35744E1B34.asc"
     target="_blank">
    <i class="fade fas fa-key"></i>
  </a>
  <a href="/index.xml" rel="alternate"
     type="application/rss+xml">
    <i class="fade fas fa-rss fa-1x"></i>
  </a>
</nav>
</header>
<div id="main">
<h1 class="title">Git Packfiles</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0a5bda0">Packfiles</a>
<ul>
<li><a href="#org7434e06">Packs</a></li>
<li><a href="#org0fbe792">Indexes</a></li>
<li><a href="#orgdec4614">Plumbing</a></li>
</ul>
</li>
<li><a href="#org1731838">Summary</a></li>
</ul>
</div>
</div>
<div class="PREVIEW">
<p>
Previously, in <a href="https://kennyballou.com/blog/2016/01/git-in-reverse">Git in Reverse</a>, we learned about <a href="https://git-scm.com/">Git</a> and how it internally
stores information.  Namely, we went over the <a href="http://stackoverflow.com/questions/5709687/what-are-the-loose-objects-that-the-git-gui-refers-to#5710039">"loose" object</a> format that Git
uses for storage.  However, in the last post, we did not discuss how Git uses
another storage format to more compactly store files, changes, and ultimately
objects.  In this post we will discuss packfiles and how Git uses these
primarily for using less bandwidth and, only secondarily, using less storage
space for storing repository contents.
</p>

</div>

<p>
We're only going to discuss the high-level details of packfiles, there are
<a href="https://git-scm.com/book/en/v2/Git-Internals-Packfiles">plenty</a> of <a href="https://git-scm.com/docs/git-verify-pack">sources</a> that
<a href="https://git.kernel.org/cgit/git/git.git/tree/Documentation/technical/pack-format.txt">describe</a> the <a href="https://codewords.recurse.com/issues/three/unpacking-git-packfiles/">details</a> better.
</p>

<div id="outline-container-org0a5bda0" class="outline-2">
<h2 id="org0a5bda0"><a id="ID-e571fbca-34f8-48b5-b511-b139f5e8156a"></a>Packfiles</h2>
<div class="outline-text-2" id="text-org0a5bda0">
<p>
Packfiles, like <a href="https://kennyballou.com/blog/2016/01/git-in-reverse">git objects before</a>, are an internal file
set for storing objects in a more compressed format.  That is, instead of
storing <i>each</i> version of a file in its entirety, Git can store a single
version of the file in its entirety and maintain an internal set of objects
which contain patches to derive the other versions.  Furthermore, Git can store
entire repository's objects into a single packfile, thus eliminating large
numbers of small files and improving efficiency of object access.
</p>

<p>
The actual files themselves are in the <code>.git/objects/pack</code> folder of a
repository and there are both pack, <code>.pack</code>, files and index, <code>.idx</code>, files.
</p>

<p>
Here is the packfile that contains this repository (as of this writing):
</p>

<pre class="example">
± find .git/objects/pack -type f
.git/objects/pack/pack-31966bc41ef450ccfecdfb5ef6cd98f7097eea38.pack
.git/objects/pack/pack-31966bc41ef450ccfecdfb5ef6cd98f7097eea38.idx
</pre>

<p>
Notice, there are not two "packs", but two files that describe the same "pack".
There is the <code>.pack</code> file itself.  This is the file that contains the actual
objects.  There is also the <code>.idx</code> file which provides an "index" of the
objects contained in the pack.
</p>

<p>
We'll take a small moment to describe each in a little more detail.
</p>
</div>

<div id="outline-container-org7434e06" class="outline-3">
<h3 id="org7434e06"><a id="ID-2769f358-432f-4363-b095-5319759246b4"></a>Packs</h3>
<div class="outline-text-3" id="text-org7434e06">
<p>
Packfiles are relatively straight forward, there's a 12 byte header, first four
spell "PACK", next four provide the version, "2" as of this writing, and the
final four provide the number of objects in this pack.  Following the header,
there's a number of objects stored in a very compact but variable length
format.  Finally, there's a 20 byte trailer that is the checksum of the
packfile's contents&#x2013; header and objects.
</p>

<p>
In the header, the number of objects is encoded in a 4-byte integer, thus,
there can only be \(2\^{32}\) or little over 4 billion objects in a packfile.
However, this does not give an upper bound of the <i>size</i> of the pack files
themselves on disk.  The length of each object is encoded in a variable length
integer prefacing each object in the packfile.
</p>

<p>
The format of the objects in the packfile is not as they usually exist in the
loose format, but it will compress them <i>more</i>, usually resulting in less space
used on disk.  That is, the objects stored in the packfile may be a base,
<i>undeltified</i> object, or it may be a <i>deltified</i> object.
</p>

<p>
Undeltified objects are not necessarily as interesting, for one, because they
are already [covered][3].  The deltified objects, however, are pretty
interesting, and definitely different.
</p>

<p>
The deltified objects, as the name might imply, contain the delta, or,
preferably, the patch and the base object name to create the defined object.
That is, Git will store inside a regular Git object a patch used to derive the
defined object.  But it only does this in the context of packfiles.
Furthermore, the structure allows for the base object to itself be a deltified
object, thus, making it possible to only store one version of the full file,
but then derive all other versions from deltas or patches.
</p>

<p>
While it is entirely possible to use only the packfile itself to access the
contained objects, it's not very efficient for random access.  Therefore, the
index file is created to maintain a way to peer into the packfile efficiently.
</p>
</div>
</div>
