blog/2017/03/git-packfiles/index.org
*** Indexes
:PROPERTIES:
:ID:       d14930d6-58d4-49dd-97e9-351165e79ed8
:END:

Packfile indexes solve the random object access efficiency problems caused by
heavily compacting objects into a single file.

Although, the contents of the index are little more complicated than the pack
file.

In version 1 of packfiles, the index does not have a header.  In version 2, the
current version, there are 8 bytes dedicated to the header: the first 4 bytes
will always be ~255, 116, 79, 99~, because these are invalid bytes for the
fanout table; the other 4 bytes of the header are dedicated to the version,
currently, ~2~.

Following the "$header", there is, what Git calls, a fanout table.  This header
table consists of 256 4-byte integers, each entry of the table records the
number of objects whose first byte are less than or equal to this entry.

That is, if the repository has 2 objects that start with ~00~, there will be a
2 in the ~00~th entry of the table.  Furthermore, if there are 3 objects that
start with ~01~, the ~01~th entry will report /5/ objects.  Remember, each
entry in the table is the sum of all previous entries ("less than or equal to
this entry").  Examining at the 256th entry would provide the total number of
objects in the packfile.

Following the fanout table is a sorted table of 20-byte SHA-1 hashes.

In version 2, there is another table following the sorted hashes that consists
of 4-byte CRC32 values of the packed object data.  This table enables easier
copying of data between packfiles.  For example, this improves the efficiency
of creating new packfiles for new objects.

Next, is another table of 4-byte offset values, usually packed into 31-bits,
larger offsets being encoded as offsets for indexes into the next table.

Last table, 8-byte offset entries, this table will be empty if the packfile is
less than 2GiB.

Finally, there is a 20-byte checksum of the packfile and another 20-byte
checksum of all of the above data.

All of these tables are used to make sure Git has very quick and efficient
access to objects in the repository.

