blog/2017/03/git-packfiles/index.html

<div id="outline-container-orgdec4614" class="outline-3">
<h3 id="orgdec4614"><a id="ID-67831768-6286-42f8-83d6-7c22881cdd40"></a>Plumbing</h3>
<div class="outline-text-3" id="text-orgdec4614">
<p>
Git will automatically create packfiles when synchronizing a repository (e.g.,
pushing, pulling, cloning), but they can also be created manually with the
<a href="https://www.kernel.org/pub/software/scm/git/docs/git-gc.html"><code>git-gc</code></a> command.  Let's assume there are some loose objects in the
current repository.
</p>

<pre class="example">
± find .git/objects -type f
.git/objects/f2/e90bed364168fcca0893437fb569d762cdbbce
.git/objects/f4/2946046ed0926d5c7b34772642478390a696c9
.git/objects/87/713bb957eef1ed6a8d12f36b2d8b328a72b453
.git/objects/8c/d57af30ad9bf0f2e0640d0141eb908d276d2f1
.git/objects/1f/846d4278f5741d33111d28c03d29b589dabffe
.git/objects/be/020e47fadb8d80281259b1f886c3940dc51a19
.git/objects/d1/2254d273712af99e0585e7dd9dfea2106d5692
.git/objects/ea/41dba10b54a794284e0be009a11f0ff3716a28
.git/objects/98/c37b0fb33a8b2f7ac4c5d94571382071ae859c
.git/objects/4d/5fcadc293a348e88f777dc0920f11e7d71441c
.git/objects/e6/9de29bb2d1d6434b8b29ae775ad8c2e48c5391
± git gc
Counting objects: 11, done.
Delta compression using up to 4 threads.
Compressing objects: 100% (5/5), done.
Writing objects: 100% (11/11), done.
Total 11 (delta 0), reused 0 (delta 0)
± find .git/objects -type f
.git/objects/info/packs
.git/objects/pack/pack-1fc05518e49da3867792b704561b68d5b00e6317.idx
.git/objects/pack/pack-1fc05518e49da3867792b704561b68d5b00e6317.pack
</pre>

<p>
We started with 11 objects, in the loose format, we ran <a href="https://www.kernel.org/pub/software/scm/git/docs/git-gc.html"><code>git-gc</code></a>
and we are left with a packfile.
</p>

<p>
The output of <a href="https://www.kernel.org/pub/software/scm/git/docs/git-gc.html"><code>git-gc</code></a> tells us how many objects we packed, how
many delta objects were used to create the pack, in this case, 0, and how many
objects were copied from an existing pack and how many deltas from an existing
pack, both 0 in this example.
</p>

<p>
Of course, we can also examine the packfile with the
<a href="https://git-scm.com/docs/git-verify-pack"><code>git-verify-pack</code></a> command:
</p>

<pre class="example">
± git verify-pack -v .git/objects/pack/pack-1fc05518e49da3867792b704561b68d5b00e6317.idx
f2e90bed364168fcca0893437fb569d762cdbbce commit 225 153 12
d12254d273712af99e0585e7dd9dfea2106d5692 commit 220 145 165
98c37b0fb33a8b2f7ac4c5d94571382071ae859c commit 172 117 310
e69de29bb2d1d6434b8b29ae775ad8c2e48c5391 blob   0 9 427
be020e47fadb8d80281259b1f886c3940dc51a19 blob   9 18 436
f42946046ed0926d5c7b34772642478390a696c9 tree   93 81 454
87713bb957eef1ed6a8d12f36b2d8b328a72b453 tree   31 40 535
8cd57af30ad9bf0f2e0640d0141eb908d276d2f1 tree   31 40 575
1f846d4278f5741d33111d28c03d29b589dabffe tree   31 42 615
ea41dba10b54a794284e0be009a11f0ff3716a28 tree   62 50 657
4d5fcadc293a348e88f777dc0920f11e7d71441c tree   31 42 707
non delta: 11 objects
.git/objects/pack/pack-1fc05518e49da3867792b704561b68d5b00e6317.pack: ok
</pre>

<blockquote>
<p>
It does not matter whether the <code>.pack</code> or <code>.idx</code> file are specified to the
<a href="https://git-scm.com/docs/git-verify-pack"><code>git-verify-pack</code></a> command, the output will be the same.
However, tab completion will prefer the <code>.idx</code> files.
</p>
</blockquote>

<p>
This output has a lot of information to it: first, it tells us about all the
objects in the packfile, we see our 11 original objects from before.  But we
are also given each object's type, size, size in pack, and offset into the
packfile, respectively.  For undeltified objects, these sizes won't be very
different, but for deltified objects, these two sizes can be significantly
different.
</p>

<p>
This output also tells us the pack contains no deltified objects.  Let's see
what this would look like with deltified objects:
</p>

<pre class="example">
± git gc
Counting objects: 17, done.
Delta compression using up to 4 threads.
Compressing objects: 100% (9/9), done.
Writing objects: 100% (17/17), done.
Total 17 (delta 1), reused 10 (delta 0)
± git verify-pack -v .git/objects/pack/pack-21f02890d9770ec6b5a566c3c82c03e69f530c19.idx
47f24ac6ba3af12714f0dbf7219b9d854f269097 commit 219 146 12
8cfd10e321ac6349132ceb93774f0a881a1b9316 commit 219 146 158
f2e90bed364168fcca0893437fb569d762cdbbce commit 225 153 304
d12254d273712af99e0585e7dd9dfea2106d5692 commit 220 145 457
98c37b0fb33a8b2f7ac4c5d94571382071ae859c commit 172 117 602
5716ca5987cbf97d6bb54920bea6adde242d87e6 blob   4 13 719
be020e47fadb8d80281259b1f886c3940dc51a19 blob   9 18 732
257cc5642cb1a054f08cc83f2d943e56fd3ebe99 blob   4 13 750
3783c58c8b17ba95b2917e5f92a0395efcec9759 tree   93 100 763
87713bb957eef1ed6a8d12f36b2d8b328a72b453 tree   31 40 863
8cd57af30ad9bf0f2e0640d0141eb908d276d2f1 tree   31 40 903
1f846d4278f5741d33111d28c03d29b589dabffe tree   31 42 943
7470c9c852271284dfb0cb8f3ad9047709847e0d tree   93 101 985
e69de29bb2d1d6434b8b29ae775ad8c2e48c5391 blob   0 9 1086
f42946046ed0926d5c7b34772642478390a696c9 tree   25 37 1095 1 7470c9c852271284dfb0cb8f3ad9047709847e0d
ea41dba10b54a794284e0be009a11f0ff3716a28 tree   62 50 1132
4d5fcadc293a348e88f777dc0920f11e7d71441c tree   31 42 1182
non delta: 16 objects
chain length = 1: 1 object
.git/objects/pack/pack-21f02890d9770ec6b5a566c3c82c03e69f530c19.pack: ok
± find .git/objects -type f
.git/objects/info/packs
.git/objects/pack/pack-21f02890d9770ec6b5a566c3c82c03e69f530c19.idx
.git/objects/pack/pack-21f02890d9770ec6b5a566c3c82c03e69f530c19.pack
</pre>

<p>
Notice, we repacked the repository then listed the contents of the new pack,
also notice the old pack is gone, but the objects that were in the old pack are
still available in the new pack.
</p>

<p>
More importantly, notice that <code>f42946</code> is a deltified object based on
<code>7470c9c</code>.  That is, the tree defined in <code>f42946</code> is derived by patching
<code>7470c9c</code> with the contents of the object in the packfile.  This is also
evident in the size listings, the size on disk of the loose object is 25 bytes,
but the size in the pack is 37.  The increase in size is often, unfortunately,
due to how text compression sometimes <i>doesn't</i> work.  This is the first look
of what Git calls "chains".
</p>

<p>
Chains are a simple way to describe the length of a deltified object set.  The
longest chain in this repository is only 1.  But if we examine bigger
repositories, this number could be much higher.  Git itself, for example, has a
chain length of 46 for one object, or another 6 objects with a chain length of
44 each.
</p>

<p>
Another thing to note, unlike the loose object format, it's much more difficult
to get to the contents of the objects in the packfile <i>using</i> only the packfile
without some effort.  However, <code>git-cat-file</code> and other plumbing commands will
still work as expected given an object name, even if the object is contained
within a packfile.
</p>
</div>
</div>
</div>

<div id="outline-container-org1731838" class="outline-2">
<h2 id="org1731838"><a id="ID-a1020e6b-57f1-4020-a1e0-e4b44481ce40"></a>Summary</h2>
<div class="outline-text-2" id="text-org1731838">
<p>
Hopefully, we now have a deeper knowledge of the compact object format Git
uses, namely, packfiles.  Remember, the motivation for these files was not
efficiency in storage, but efficiency in network bandwidth when transferring
objects and lookup speed when there's a large number of loose objects.  Thus,
if working in stealth mode, it can be sometimes important to run
<a href="https://www.kernel.org/pub/software/scm/git/docs/git-gc.html"><code>git-gc</code></a> occasionally to keep your private repository quick and
efficient.
</p>
</div>
</div>
</div>
<footer id="" class="status">
<footer>
  <p>&copy; 2014-2022 Kenny Ballou.
    <a href="http://creativecommons.org/licenses/by-nc-sa/4.0/">Some rights
      reserved.</a></p>
  <p>Powered by <a href="https://gnu.org">GNU/Linux</a></p>
</footer>
</footer>
</body>
</html>
